/**
 * @file gui.c
 * @brief Реализации функций интерфейса в графическом режиме. Заглушка для
 * будущих проектов.
 *
 * @note Не используется в проекте на данный момент.
 */
#include <stdio.h>

/**
 * @brief Инициализатор интерфейса в графическом режиме. Заглушка.
 *
 * @note Не используется в проекте на данный момент.
 *
 * @retval 0 - в любом случае.
 */
int interface(void) {
  printf(
      "Заглушка для графического интерфейса\n"
      "\tНе используется в проекте на данный момент\n");
  return 0;
}

/**
 * @brief Инициализатор интерфейса в графическом режиме. Заглушка.
 *
 * @note Не используется в проекте на данный момент.
 */
void startInterface(void) {
  printf(
      "Заглушка для инициализатора графического интерфейса\n"
      "\tНе используется в проекте на данный момент\n");
}

/**
 * @brief Остановка интерфейса в графическом режиме. Заглушка.
 *
 * @note Не используется в проекте на данный момент.
 */
void endInterface(void) {
  printf(
      "Заглушка для остановки графического интерфейса\n"
      "\tНе используется в проекте на данный момент\n");
}
